# Задача 2. Поиск наибольшего числа в списке.
# Напишите программу, которая принимает список чисел через строку
# и возвращает наибольшее число в этом списке.

data = [42, 73, 5, 42, 42, 2, 3, 7, 73, 42, 215]

print(max(data))
